app/controllers/home_controller.rb

    def search
        key = params[:search]
        search = Word.where('rumi LIKE ?', "#{key}%").order(:rumi).includes(:extendeds, :examples)

        results = []
        search.each do |word|
            result = {}
            result["title"] = word.rumi
            result["description"] = {}
            result["description"]["akharThrah"] = word.akharThrah
            result["description"]["source"] = word.source
            result["description"]["pronunciation"] = word.pronunciation
            fullMeaning = []
            word.extendeds.each do |exten|
---
SELECT `example`.* FROM `example` WHERE `example`.`extendedId` IN (2, 3, 10)
SELECT `extended`.* FROM `extended` WHERE `extended`.`wordId` IN (2, 5)
SELECT `word`.* FROM `word` WHERE (rumi LIKE 'abu%') ORDER BY `word`.`rumi` ASC
SELECT `example`.* FROM `example` WHERE `example`.`extendedId` IN (1, 2, 3, 10)
SELECT `extended`.* FROM `extended` WHERE `extended`.`wordId` IN (1, 6, 2, 5, 8, 7)
SELECT `word`.* FROM `word` WHERE (rumi LIKE 'aban%') ORDER BY `word`.`rumi` ASC
SELECT `extended`.* FROM `extended` WHERE `extended`.`wordId` IN (3, 4)